{
    "company": "Pinterest",
    "role": "Technical Lead – Senior Staff Cloud Systems Engineer",
    "level": "Senior Staff",
    "location": "San Francisco, CA (Remote)",
    "startDate": "2021-06-01",
    "endDate": null,
    "description": "Strategic infrastructure leadership focused on multi-region architecture, networking optimization, and organizational change management. Collaborated directly with the Chief Architect and Engineering Leadership on Pinterest's infrastructure strategy.",
    "achievements": [
        "Served as the Directly Responsible Individual (DRI) for Pinterest's Multi-Region and Multi-Account initiatives, collaborating directly with the Chief Architect and Engineering Leadership.",
        "Architected Pinterest's Next-Gen Network Architecture, enhancing infrastructure stability by combining centralized connectivity with distributed control mechanisms.",
        "Conducted comprehensive analysis on AZ balances and data transfer costs, transitioning from Transit Gateway to direct VPC peering, reducing annual networking costs from $10 million to $0.",
        "Successfully advocated for organizational adoption of a Multi-Account architecture, influencing Pinterest's long-term infrastructure strategy.",
        "Supported major Data Engineering initiatives, including Spark on EKS, facilitating transition to a robust Multi-Account environment.",
        "Founded and built the Pinterest Cloud Architecture team, defining core pillars, team charter, and strategic roadmaps.",
        "Built DR tooling at a fraction of vendor cost; achieved order-of-magnitude improvement in recovery time.",
        "Led EC2 provisioning at hyperscale—large-scale compute infrastructure and petabytes of storage.",
        "Established Infrastructure as Code (IaC) standards and Terraform CI/CD pipelines, enhancing operational safety, consistency, and reducing deployment failures.",
        "Directly mentored 12–14 engineers, significantly contributing to professional growth and retention.",
        "Provided indirect mentorship across Security, Infrastructure Provisioning, and SRE teams.",
        "Led cross-team educational workshops increasing internal engineering capability in cloud networking and IaC."
    ],
    "skills": [
        "AWS",
        "Network Architecture",
        "Terraform",
        "Disaster Recovery",
        "Multi-Region Architecture",
        "Multi-Account Architecture",
        "Cost Optimization",
        "EKS",
        "Spark on EKS",
        "VPC Peering",
        "Transit Gateway",
        "IAM",
        "Strategic Leadership",
        "Team Building",
        "Mentorship",
        "Cross-Team Collaboration"
    ],
    "domainTags": [
        "Cloud Architecture",
        "Networking",
        "Infrastructure Automation",
        "Leadership"
    ]
}
